In [2]:
import sqlite3
import pandas as pd

In [11]:
def query(sql, params=()):
    with sqlite3.connect("../align.db") as con:
        x = pd.read_sql_query(sql, con, params = params)
    return x

In [12]:
query("select * from sqlite_master")

,type,name,tbl_name,rootpage,sql
0,table,alignments_raw,alignments_raw,1332,"CREATE TABLE alignments_raw (source text, targ..."
1,table,alignments_agg,alignments_agg,48,"CREATE TABLE alignments_agg (source text, targ..."

In [17]:
query("select * from alignments_agg where target = 'kvinnen' order by freq desc limit 10")

     source   target  freq
0   kvinden  kvinnen    23
1   kvinnen  kvinnen    22
2   Kvinnen  kvinnen     2
3    kvinde  kvinnen     2
4   Kvinden  kvinnen     1
5     engel  kvinnen     1
6  hustruen  kvinnen     1